#+title: Bonk Modules
#+OPTIONS: toc:t
#+PROPERTY: header-args:emacs-lisp :tangle ./../core/bonk-modules.el :mkdirp yes
** TODO Module config macros

#+begin_src emacs-lisp
  ;;
  ;;; Module config macros

  (put :if     'lisp-indent-function 2)
  (put :when   'lisp-indent-function 'defun)
  (put :unless 'lisp-indent-function 'defun)

  (defmacro bonk! (&rest modules)
	"Bootstraps BONK Emacs and its modules.

  If the first item in MODULES doesn't satisfy `keywordp', MODULES is evaluated,
  otherwise, MODULES is a multiple-property list (a plist where each key can have
  multiple, linear values).

  The bootstrap process involves making sure the essential directories exist, core
  packages are installed, `bonk-autoloads-file' is loaded, `bonk-packages-file'
  cache exists (and is loaded) and, finally, loads your private init.el (which
  should contain your `bonk!' block).

  Module load order is determined by your `bonk!' block. See `bonk-core-dirs'
  for a list of all recognized module trees. Order defines precedence (from most
  to least)."
	`(when noninteractive
	   (bonk-module-mplist-map
		(lambda (category module &rest plist)
		  (let ((path (bonk-module-locate-path category module)))
			(unless path
			  (print! (warn "Failed to locate a '%s %s' module") category module))
			(apply #'bonk-module-set category module
				   :path path
				   plist)))
		,@(if (keywordp (car modules))
			  (list (list 'quote modules))
			modules))
	   bonk-modules))
  


#+end_src

#+RESULTS:
: bonk!

** modulep!
#+begin_src emacs-lisp

(defmacro modulep! (category &optional module flag)
  "Return t if :CATEGORY MODULE (and +FLAGS) are enabled.

If FLAG is provided, returns t if CATEGORY MODULE has FLAG enabled.

  (modulep! :config default +flag)

CATEGORY and MODULE may be omitted when this macro is used from a Bonk module's
source (except your BONKDIR, which is a special module). Like so:

  (modulep! +flag)

For more about modules and flags, see `bonk!'."
  ;; PERF: This macro bypasses the module API to spare startup their runtime
  ;;   cost, as `modulep!' gets called *a lot* during startup. In the future,
  ;;   Bonk will byte-compile its core files. At that time, we can use it again.
  (and (cond (flag (memq flag (aref (or (get category module) bonk--empty-module-context)
                                    (bonk-module--context-field flags))))
             (module (get category module))
             ((aref bonk-module-context 0)
              (memq category (aref bonk-module-context
                                   (bonk-module--context-field flags))))
             ((let ((file
                     ;; This must be expanded at the call site, not in
                     ;; `modulep!'s definition, to get the file we want.
                     (macroexpand '(file!))))
                (if-let (module (bonk-module-from-path file))
                    (memq category (aref (or (get (car module) (cdr module))
                                             bonk--empty-module-context)
                                         (bonk-module--context-field flags)))
                  (error "(modulep! %s %s %s) couldn't figure out what module it was called from (in %s)"
                         category module flag file)))))
       t))
#+end_src

#+RESULTS:
: modulep!

